In [3]:
import pandas as pd

In [4]:
file = 'volcanoes.csv'
df = pd.read_csv(file)

In [5]:
df.head()

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 36 columns):
Year                                  458 non-null int64
Month                                 446 non-null float64
Day                                   417 non-null float64
TSU                                   67 non-null object
EQ                                    22 non-null object
Name                                  458 non-null object
Location                              458 non-null object
Country                               458 non-null object
Latitude                              458 non-null float64
Longitude                             458 non-null float64
Elevation                             458 non-null int64
Type                                  458 non-null object
Status                                458 non-null object
Time                                  458 non-null object
VEI                                   331 non-null float64
Agent                                 286 non-null object
DEATHS                                307 non-null float64
DEATHS_DESCRIPTION                    328 non-null float64
MISSING                               8 non-null float64
MISSING_DESCRIPTION                   10 non-null float64
INJURIES                              81 non-null float64
INJURIES_DESCRIPTION                  98 non-null float64
DAMAGE_MILLIONS_DOLLARS               14 non-null float64
DAMAGE_DESCRIPTION                    131 non-null float64
HOUSES_DESTROYED                      27 non-null float64
HOUSES_DESTROYED_DESCRIPTION          64 non-null float64
TOTAL_DEATHS                          315 non-null float64
TOTAL_DEATHS_DESCRIPTION              336 non-null float64
TOTAL_MISSING                         7 non-null float64
TOTAL_MISSING_DESCRIPTION             10 non-null float64
TOTAL_INJURIES                        80 non-null float64
TOTAL_INJURIES_DESCRIPTION            103 non-null float64
TOTAL_DAMAGE_MILLIONS_DOLLARS         16 non-null float64
TOTAL_DAMAGE_DESCRIPTION              135 non-null float64
TOTAL_HOUSES_DESTROYED                27 non-null float64
TOTAL_HOUSES_DESTROYED_DESCRIPTION    68 non-null float64
dtypes: float64(25), int64(2), object(9)
memory usage: 128.9+ KB

In [6]:
#Which country had the most erputions over the 100 years?
total_eruptions_county = df['Country'].value_counts()

total_eruptions_county.head()

Indonesia        121
Japan             85
Philippines       28
Italy             25
United States     24
Name: Country, dtype: int64

In [8]:
#What year had the most eruptions?
total_eruptions_year = df['Year'].value_counts()
total_eruptions_year.head()

2018    11
1990    10
2011    10
1997     9
1953     9
Name: Year, dtype: int64

In [9]:
#What month had the most eruptions?
total_eruptions_month = df['Month'].value_counts()
total_eruptions_month.head()

#change months from numbers to words - come back to this later!!!!

8.0    51
7.0    45
1.0    44
5.0    43
9.0    42
Name: Month, dtype: int64

In [10]:
#What is distrubtion over magnitudes (VEI)?
total_eruptions_per_vei = df['VEI'].value_counts()
total_eruptions_per_vei.head()

3.0    124
2.0    118
1.0     39
4.0     34
5.0      7
Name: VEI, dtype: int64

In [11]:
#Top 10 magnitudes 

df1 = df[['Name', 'VEI', 'Location']]
df1.sort_values(by='VEI', ascending=False)


top_10_eruptions = df1.loc[df1['VEI'] > 4.9]

top_10_eruptions.sort_values(by='VEI', ascending=False)

              Name  VEI           Location
12     Santa Maria  6.0          Guatemala
33       Novarupta  6.0   Alaska Peninsula
294       Pinatubo  6.0  Luzon-Philippines
155     Bezymianny  5.0          Kamchatka
173          Agung  5.0    Lesser Sunda Is
243     St. Helens  5.0      US-Washington
253    Chichon, El  5.0             Mexico
254    Chichon, El  5.0             Mexico
256    Chichon, El  5.0             Mexico
297  Hudson, Cerro  5.0            Chile-S

In [12]:
#DAMAGE_MILLIONS_DOLLARS  
top_damage_millions = df.sort_values(by='DAMAGE_MILLIONS_DOLLARS', ascending=False)

top_damage_millions_df = top_damage_millions[['Name', 'Year', 'VEI', 'Location', 'DAMAGE_MILLIONS_DOLLARS']]

top_damage_millions_df.head(10)

             Name  Year  VEI            Location  DAMAGE_MILLIONS_DOLLARS
243    St. Helens  1980  5.0       US-Washington                  2000.00
398        Merapi  2010  NaN                Java                   600.00
435      Sinabung  2016  NaN             Sumatra                   100.00
321        Rabaul  1994  3.0  New Britain-SW Pac                    35.00
255    Galunggung  1982  4.0                Java                    15.00
425       Kilauea  2014  NaN         Hawaiian Is                    14.50
246          Etna  1981  2.0               Italy                    10.00
448         Mayon  2018  NaN   Luzon-Philippines                     3.72
253   Chichon, El  1982  5.0              Mexico                     3.30
302  Negro, Cerro  1992  3.0           Nicaragua                     3.00

In [13]:
#Whats the most damage total by eruption(summed)?

total_damage_greater_than_zero = df.loc[df['DAMAGE_MILLIONS_DOLLARS'] > 0]

total_damage_volcano = total_damage_greater_than_zero.groupby('Name')['DAMAGE_MILLIONS_DOLLARS'].sum()

total_damage_volcano

Name
Chichon, El        3.30
Etna              12.50
Galunggung        15.00
Kilauea           15.50
Mayon              3.72
Merapi           600.00
Negro, Cerro       3.00
Rabaul            35.00
Sakura-jima        0.04
Sinabung         100.00
Spurr              2.00
St. Helens      2000.00
Name: DAMAGE_MILLIONS_DOLLARS, dtype: float64

In [14]:
#Most damanage by year in millions?
total_damage_greater_than_zero = df.loc[df['DAMAGE_MILLIONS_DOLLARS'] > 0]

total_damage_volcano_year = total_damage_greater_than_zero.groupby('Year')['DAMAGE_MILLIONS_DOLLARS'].sum()

total_damage_volcano_year

Year
1914       0.04
1980    2000.00
1981      10.00
1982      18.30
1991       2.50
1992       5.00
1994      35.00
2010     600.00
2014      14.50
2016     100.00
2018       4.72
Name: DAMAGE_MILLIONS_DOLLARS, dtype: float64

In [15]:
#Most deaths 

top_deaths = df.sort_values(by='TOTAL_DEATHS', ascending=False)

top_deaths1 = top_deaths[['Name', 'Year', 'VEI', 'Location', 'TOTAL_DEATHS']]

top_deaths1.head()

            Name  Year  VEI    Location  TOTAL_DEATHS
8          Pelee  1902  4.0    W Indies       28000.0
266         Ruiz  1985  3.0    Colombia       23080.0
12   Santa Maria  1902  6.0   Guatemala       10000.0
54         Kelut  1919  4.0        Java        5110.0
128    Lamington  1951  4.0  New Guinea        2942.0

In [17]:
#Create Bins of Decades
bins = [1899, 1909, 1919, 1929, 1939, 1949, 1959, 1969, 1979, 1989, 1999, 2009, 2018]

group_names = ["1900s", "1910s", "1920s", "1930s", "1940s", "1950s", "1960s", "1970s", "1980s", "1990s", "2000s", "2010s" ]

df["Decade"] = pd.cut(df["Year"], bins, labels=group_names)